04_OpenFoam/_Tut_02/OpenFOAM-14/shockFluid/shockTube/0/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [temperature];

internalField
{
    type        zonal;

    defaultValue    348.432;

    zones
    {
        lowPressure
        {
            type            box;

            box             (0 -1 -1) (5 1 1);

            value           278.746;
        }
    }
}

boundaryField
{
    sides
    {
        type            zeroGradient;
    }

    empty
    {
        type            empty;
    }
}

// ************************************************************************* //
